In [ ]:
# With the same attachment, use each worksheet as a CSV file and write a script (Bash or Python) 
# that generates the same report. Data is to be read from the CSV files not from a database.

In [11]:
import pandas as pd

In [12]:
# importing CSV files of  the Departments, Employees, and Salaries data from CSV files for reading Data

In [13]:
departments = pd.read_csv("C:/Users/dell/Downloads/Departments.csv")

In [14]:
employees = pd.read_csv("C:/Users/dell/Downloads/Employees.csv")

In [18]:
salaries = pd.read_csv("C:/Users/dell/Downloads/Salaries.csv")

In [22]:
df = pd.merge(departments,employees, left_on='ID',right_on='DEPT ID')

In [27]:
data_table= pd.merge(df,salaries,left_on="ID_y",right_on='EMP_ID')

In [31]:
data_table

     ID_x NAME_x  ID_y   NAME_y  DEPT ID  EMP_ID  MONTH (YYYYMM)  AMT (USD)
0       1     HR     1     Jack        1       1          202207       5000
1       1     HR     1     Jack        1       1          202208       5000
2       1     HR     2     John        1       2          202207       4000
3       1     HR     2     John        1       2          202208       4000
4       1     HR    10  Shirley        1      10          202207       4800
..    ...    ...   ...      ...      ...     ...             ...        ...
166     5  Sales    16   Howard        5      16          202305       7500
167     5  Sales    16   Howard        5      16          202306       7500
168     5  Sales    21    Bruce        5      21          202304       4800
169     5  Sales    21    Bruce        5      21          202305       4800
170     5  Sales    21    Bruce        5      21          202306       4800

[171 rows x 8 columns]

In [32]:
ans=data.groupby(['NAME_x'])['AMT (USD)'].mean()

In [33]:
ans.sort_values(ascending=False).head(3)

NAME_x
Sales      7045.16129
Ops        6420.00000
Finance    6360.31746
Name: AMT (USD), dtype: float64